In [10]:
! pip install numpy
! pip install pandas

Requirement already satisfied: numpy in c:\users\ragul\anaconda3\lib\site-packages (1.24.3)
Requirement already satisfied: pandas in c:\users\ragul\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ragul\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ragul\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\ragul\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\ragul\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\ragul\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [ ]:
import numpy as np
import pandas as pd

In [12]:
df=pd.read_csv(r"C:\Philip Samuel M\final_data.csv")

In [17]:
df_categorical = df.select_dtypes(exclude=['number'])

In [18]:
df_categorical

,Company_Name,Class,Designation,Location,Level,Involvement,Industry
0,Wipro,Class 3,Project Manager,Maharashtra,Full-time,Entry level,IT Services and IT Consulting
1,Wipro,Class 3,Project Manager,Delhi,Full-time,Entry level,IT Services and IT Consulting
2,Wipro,Class 3,Project Manager,Delhi,Full-time,Entry level,IT Services and IT Consulting
3,Wipro,Class 3,Administrator,Telangana,Full-time,Mid-Senior level,IT Services and IT Consulting
4,Wipro,Class 3,Project Manager,Maharashtra,Full-time,Entry level,IT Services and IT Consulting
...,...,...,...,...,...,...,...
806,Infosys,Class 3,Java Developer (5-8 yrs) Indore,Madhya Pradesh,Full-time,Mid-Senior level,IT Services and IT Consulting
807,Infosys,Class 3,Technology Analyst - NodeJs (3-5 years) - Bhub...,Odisha,Full-time,Entry level,IT Services and IT Consulting
808,Genpact,Class 1,Hiring for OTC- JAIPUR,Rajasthan,Full-time,Entry level,IT Services and IT Consulting
809,Genpact,Class 1,C++ Developer,Telangana,Full-time,Mid-Senior level,IT Services and IT Consulting
810,Genpact,Class 1,Hiring for RTR- Jaipur,Rajasthan,Full-time,Associate,IT Services and IT Consulting

In [22]:
df_categorical['Location'].unique()

array([' Maharashtra', ' Delhi', ' Telangana', ' Karnataka', ' Haryana',
       ' Tamil Nadu', ' Uttar Pradesh', ' West Bengal', ' Kerala',
       ' Madhya Pradesh', ' Odisha', ' Andhra Pradesh', ' Rajasthan',
       ' India', ' Gujarat', ' Punjab'], dtype=object)

In [23]:
df_categorical['Location'].unique()

array([' Maharashtra', ' Delhi', ' Telangana', ' Karnataka', ' Haryana',
       ' Tamil Nadu', ' Uttar Pradesh', ' West Bengal', ' Kerala',
       ' Madhya Pradesh', ' Odisha', ' Andhra Pradesh', ' Rajasthan',
       ' India', ' Gujarat', ' Punjab'], dtype=object)

In [26]:
df_categorical.Location.value_counts()

Location
 Maharashtra       205
 Telangana         166
 Karnataka         148
 Tamil Nadu         59
 Uttar Pradesh      54
 Delhi              48
 Haryana            31
 West Bengal        27
 Rajasthan          17
 Gujarat            14
 Kerala             10
 Odisha              9
 India               9
 Madhya Pradesh      7
 Andhra Pradesh      6
 Punjab              1
Name: count, dtype: int64

In [28]:
df_categorical.Class.value_counts()

Class
Class 4    362
Class 1    194
Class 3    131
Class 2    124
Name: count, dtype: int64

In [29]:
df_categorical.Company_Name.value_counts()

Company_Name
IDESLABS PRIVATE LIMITED     265
LTIMindtree                  187
Uplers                       122
Wipro                        102
ACURA SOLUTIONS LTD           97
Infosys                       15
Tata Consultancy Services     14
Vodafone Idea Limited          3
Genpact                        3
Cactus Communications          2
UST                            1
Name: count, dtype: int64

In [31]:
df_categorical.Class.replace({"1st Class":1, "2nd Class":2, "3rd Class":3,}, inplace=
True)

In [32]:
df_categorical.head()

,Company_Name,Class,Designation,Location,Level,Involvement,Industry
0,Wipro,Class 3,Project Manager,Maharashtra,Full-time,Entry level,IT Services and IT Consulting
1,Wipro,Class 3,Project Manager,Delhi,Full-time,Entry level,IT Services and IT Consulting
2,Wipro,Class 3,Project Manager,Delhi,Full-time,Entry level,IT Services and IT Consulting
3,Wipro,Class 3,Administrator,Telangana,Full-time,Mid-Senior level,IT Services and IT Consulting
4,Wipro,Class 3,Project Manager,Maharashtra,Full-time,Entry level,IT Services and IT Consulting